picohari/freertos_stm32f4/src/hw/onewire/onewire.h
/**
  ******************************************************************************
  * @file    ONEWIRE/UART_Printf/Inc/main.h 
  * @author  MCD Application Team
  * @version V1.3.0
  * @date    17-February-2017
  * @brief   Header for onewire.c module
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2017 STMicroelectronics</center></h2>>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __ONEWIRE_H
#define __ONEWIRE_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "cmsis_os.h"
  

/* Exported types ------------------------------------------------------------*/


 
 /* Exported constants --------------------------------------------------------*/

/* Exported macro ------------------------------------------------------------*/

/* Exported functions ------------------------------------------------------- */

void ow_timer3_init(void);
void ow_delay_us(uint16_t us);
void ow_gpio_init(void);


typedef struct {
  GPIO_TypeDef* GPIOx;           /*!< GPIOx port to be used for I/O functions */
  uint16_t GPIO_Pin;             /*!< GPIO Pin to be used for I/O functions */
  uint8_t LastDiscrepancy;       /*!< Search private */
  uint8_t LastFamilyDiscrepancy; /*!< Search private */
  uint8_t LastDeviceFlag;        /*!< Search private */
  uint8_t ROM_NO[8];             /*!< 8-bytes address of last search device */
} OneWire_t;

/* OneWire delay */
void ONEWIRE_DELAY(uint16_t time_us);

/* Pin settings */
void ONEWIRE_LOW(OneWire_t *gp);      
void ONEWIRE_HIGH(OneWire_t *gp);   
void ONEWIRE_INPUT(OneWire_t *gp);    
void ONEWIRE_OUTPUT(OneWire_t *gp);   

/* OneWire commands */
#define ONEWIRE_CMD_RSCRATCHPAD     0xBE
#define ONEWIRE_CMD_WSCRATCHPAD     0x4E
#define ONEWIRE_CMD_CPYSCRATCHPAD   0x48
#define ONEWIRE_CMD_RECEEPROM       0xB8
#define ONEWIRE_CMD_RPWRSUPPLY      0xB4
#define ONEWIRE_CMD_SEARCHROM       0xF0
#define ONEWIRE_CMD_READROM         0x33
#define ONEWIRE_CMD_MATCHROM        0x55
#define ONEWIRE_CMD_SKIPROM         0xCC

//#######################################################################################################

void    OneWire_Init(OneWire_t* OneWireStruct, GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);
uint8_t OneWire_Reset(OneWire_t* OneWireStruct);
uint8_t OneWire_ReadByte(OneWire_t* OneWireStruct);
void    OneWire_WriteByte(OneWire_t* OneWireStruct, uint8_t byte);
void    OneWire_WriteBit(OneWire_t* OneWireStruct, uint8_t bit);
uint8_t OneWire_ReadBit(OneWire_t* OneWireStruct);
uint8_t OneWire_Search(OneWire_t* OneWireStruct, uint8_t command);
void    OneWire_ResetSearch(OneWire_t* OneWireStruct);
uint8_t OneWire_First(OneWire_t* OneWireStruct);
uint8_t OneWire_Next(OneWire_t* OneWireStruct);
void    OneWire_GetFullROM(OneWire_t* OneWireStruct, uint8_t *firstIndex);
void    OneWire_Select(OneWire_t* OneWireStruct, uint8_t* addr);
void    OneWire_SelectWithPointer(OneWire_t* OneWireStruct, uint8_t* ROM);
uint8_t OneWire_CRC8(uint8_t* addr, uint8_t len);

//#######################################################################################################






#endif /* __ONEWIRE_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

